DOCUMENTATION/bcmd-design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-14 Wed 07:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Design of bcmd</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Xianwen Chen" />
</head>
<body>
<div id="content">
<h1 class="title">The Design of bcmd</h1>
<p>
bcmd is a shell script that runs a command and emails the output to an email address.
</p>

<p>
It is a shell script.
</p>

<p>
A working local smtp server is required.
</p>

<p>
bcmd starts with a shebang.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgf91b5b2"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">sh</span>
</pre>
</div>

<p>
bcmd saves the log file in /tmp by user name.
It needs to know the user name.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgbf20156"><span style="color: #a0522d;">user</span>=$(whoami)
</pre>
</div>

<p>
bcmd takes two parameters.
The <span class="underline">t</span> parameter takes the email address that the output will be sent to.
The <span class="underline">c</span> parameter takes the command.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org50fa680"><span style="color: #a020f0;">while </span><span style="color: #483d8b;">getopts</span> t:c: flag
<span style="color: #a020f0;">do</span>
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">"${flag}"</span><span style="color: #a020f0;"> in</span>
        t) <span style="color: #a0522d;">mailto</span>=${<span style="color: #a0522d;">OPTARG</span>};;
        c) <span style="color: #a0522d;">cmd</span>=${<span style="color: #a0522d;">OPTARG</span>};;
    <span style="color: #a020f0;">esac</span>
<span style="color: #a020f0;">done</span>
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Mail to: $mailto"</span>;
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Command: $cmd"</span>;
</pre>
</div>

<p>
bcmd sets the output files, which include an email file and the command file.
The email follows the structure of an email that <i>sendmail</i> would take.
It includes a subject line, while the rest is the output from the command.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orga958232"><span style="color: #483d8b;">echo</span> 0; <span style="color: #8b2252;">\</span>
    <span style="color: #a0522d;">email_file</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-email-$(date +%s%N).txt; <span style="color: #8b2252;">\</span>
    <span style="color: #a0522d;">cmd_file</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-cmd-$(date +%s%N).txt; <span style="color: #8b2252;">\</span>
</pre>
</div>

<p>
Echo the subject line to the email file.
In the email body, echo the date.
Run the command, of which the output is added to the email body.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org0af843d"><span style="color: #483d8b;">echo</span> 1; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Subject: bash output: $cmd"</span> &gt;&gt; $<span style="color: #a0522d;">email_file</span>; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">""</span> &gt;&gt; $<span style="color: #a0522d;">email_file</span>; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 2; <span style="color: #8b2252;">\</span>
date &gt;&gt; $<span style="color: #a0522d;">email_file</span>; <span style="color: #8b2252;">\</span>
    <span style="color: #483d8b;">echo</span> 3; <span style="color: #8b2252;">\</span>
    <span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">cmd</span> &gt; $<span style="color: #a0522d;">cmd_file</span>; <span style="color: #8b2252;">\</span>
    chmod +x $<span style="color: #a0522d;">cmd_file</span>; <span style="color: #8b2252;">\</span>
    bash $<span style="color: #a0522d;">cmd_file</span> 2&gt;&amp;1 &gt;&gt; $<span style="color: #a0522d;">email_file</span>; <span style="color: #8b2252;">\</span>
</pre>
</div>

<p>
Send the email.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgfd4da7b"><span style="color: #483d8b;">echo</span> 4; <span style="color: #8b2252;">\</span>
sendmail -v $<span style="color: #a0522d;">mailto</span> &lt; $<span style="color: #a0522d;">email_file</span>; <span style="color: #8b2252;">\</span>
</pre>
</div>

<p>
Move the email and command files, so that five last histories are kep.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org937b743"><span style="color: #483d8b;">echo</span> 5; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">log_bak_5</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-log-bak-5.txt; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">cmd_bak_5</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-cmd-bak-5.txt; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 6; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">log_bak_4</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-log-bak-4.txt; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">cmd_bak_4</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-cmd-bak-4.txt; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 7; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">log_bak_3</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-log-bak-3.txt; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">cmd_bak_3</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-cmd-bak-3.txt; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 8; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">log_bak_2</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-log-bak-2.txt; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">cmd_bak_2</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-cmd-bak-2.txt; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 9; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">log_bak_1</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-log-bak-1.txt; <span style="color: #8b2252;">\</span>
<span style="color: #a0522d;">cmd_bak_1</span>=/tmp/bcmd-$<span style="color: #a0522d;">user</span>-cmd-bak-1.txt; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 10; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">log_bak_4</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">log_bak_4</span> $<span style="color: #a0522d;">log_bak_5</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">cmd_bak_4</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">cmd_bak_4</span> $<span style="color: #a0522d;">cmd_bak_5</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 11; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">log_bak_3</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">log_bak_3</span> $<span style="color: #a0522d;">log_bak_4</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">cmd_bak_3</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">cmd_bak_3</span> $<span style="color: #a0522d;">cmd_bak_4</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 12; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">log_bak_2</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">log_bak_2</span> $<span style="color: #a0522d;">log_bak_3</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">cmd_bak_2</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">cmd_bak_2</span> $<span style="color: #a0522d;">cmd_bak_3</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 13; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">log_bak_1</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">log_bak_1</span> $<span style="color: #a0522d;">log_bak_2</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #a020f0;">if</span> [ -e $<span style="color: #a0522d;">cmd_bak_1</span> ]; <span style="color: #a020f0;">then</span>
    mv $<span style="color: #a0522d;">cmd_bak_1</span> $<span style="color: #a0522d;">cmd_bak_2</span>
<span style="color: #a020f0;">fi</span>; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 14; <span style="color: #8b2252;">\</span>
mv $<span style="color: #a0522d;">email_file</span> $<span style="color: #a0522d;">log_bak_1</span>; <span style="color: #8b2252;">\</span>
mv $<span style="color: #a0522d;">cmd_file</span> $<span style="color: #a0522d;">cmd_bak_1</span>; <span style="color: #8b2252;">\</span>
</pre>
</div>

<p>
List the output files.
Echo the current time before ending the program.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org337e512"><span style="color: #483d8b;">echo</span> 15; <span style="color: #8b2252;">\</span>
ls -alh /tmp/bcmd-$<span style="color: #a0522d;">user</span>* ; <span style="color: #8b2252;">\</span>
<span style="color: #483d8b;">echo</span> 16; <span style="color: #8b2252;">\</span>
date;
</pre>
</div>

<p>
Put every piece together.
Tangle it to ../bcmd.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org0a65d5b">&lt;&lt;shebang&gt;&gt;

&lt;&lt;get-username&gt;&gt;

<span style="color: #ffa54f;">&lt;&lt;readparameters&gt;&gt;</span>

<span style="color: #ffa54f;">&lt;&lt;outputfiles-setup&gt;&gt;</span>

<span style="color: #ffa54f;">&lt;&lt;outputfile-email&gt;&gt;</span>

<span style="color: #ffa54f;">&lt;&lt;sendmail&gt;&gt;</span>

<span style="color: #ffa54f;">&lt;&lt;outputfiles-save&gt;&gt;</span>

<span style="color: #ffa54f;">&lt;&lt;end&gt;&gt;</span>
</pre>
</div>

<p>
../bcmd needs to be executable.
The code below is executed, when this org document is exported, which sets ../bcmd to be executable.
</p>

<div class="org-src-container">
<pre class="src src-sh">chmod +x ../bcmd
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Xianwen Chen</p>
<p class="date">Created: 2021-04-14 Wed 07:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
